Hk42/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// =============================================================================
// 全局控制参数
// =============================================================================

// 在创建任何面片后是否同步耦合点
// 注意：这不适用于具有变换的多个耦合面片上的点（例如周期性边界）
pointSync false;

patches
(
    {
        name inletA;        // 新面片的名字
        patchInfo
        {
            type patch;    

        }
        constructFrom set;  // 从面集构造
        set inletA;    // 使用我们刚刚创建的面集
    }

    {
        name outletB;        // 新面片的名字
        patchInfo
        {
            type wall;    

        }
        constructFrom set;  // 从面集构造
        set outletB;    // 使用我们刚刚创建的面集
    }


);

// ************************************************************************* //