Hk42/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        gradient        $internalField;
        value           $internalField;
    }

    inletA
   {
        type            zeroGradient;

   }

    outlet
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }

    wall
    {
        type            zeroGradient;
    }

    buildings
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            symmetry;    // 或 zeroGradient，看 boundary 文件
    }


    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
