Hk42/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    inletA
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0.001;
    }


    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        // SST 使用壁面函数处理 k
        type            kqRWallFunction;
        value           uniform 0.0;
    }

    buildings
    {
        // SST 使用壁面函数处理 k
        type            kqRWallFunction;
        value           uniform 0.0;
    }

     frontAndBack
    {
        // SST 使用壁面函数处理 k
        type            symmetry;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
