Hk42/system/cutPlaneSurface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out cut-plane surface files with interpolated field data in VTK
    format.

\*---------------------------------------------------------------------------*/

point  (0 0 0.0242);


normal  (0 0 1);


fields      (p U Ux);

interpolate true; // If false, write cell data to the surface triangles.
                  // If true, write interpolated data at the surface points.

#includeEtc "caseDicts/functions/surface/cutPlaneSurface.cfg"

// ************************************************************************* //
