Hk42/system/interfaceHeight
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Reports the height of the interface above a set of locations. For each
    location, it writes the vertical distance of the interface above both the
    location and the lowest boundary. It also writes the point on the interface
    from which these heights are computed. It uses an integral approach, so if
    there are multiple interfaces above or below a location then this method
    will generate average values.
\*---------------------------------------------------------------------------*/

points
(
    (1.02 0.86 0)     // 0.2735 + 0.75
    (1.02 0.57 0)
    (1.02 0.29 0)

    (1.59 0.86 0)     // 0.8435 + 0.75
    (1.59 0.57 0)
    (1.59 0.29 0)

    (2.32 0.86 0)     // 1.5665 + 0.75
    (2.32 0.57 0)
    (2.32 0.29 0)

    (3.02 0.86 0)     // 2.2685 + 0.75
    (3.02 0.57 0)
    (3.02 0.29 0)

    (3.75 0.86 0)     // 3.0035 + 0.75
    (3.75 0.57 0)
    (3.75 0.29 0)

    (4.46 0.86 0)     // 3.7085 + 0.75
    (4.46 0.57 0)
    (4.46 0.29 0)

    (5.17 0.86 0)     // 4.4235 + 0.75
    (5.17 0.57 0)
    (5.17 0.29 0)

    (5.89 0.86 0)     // 5.1385 + 0.75
    (5.89 0.57 0)
    (5.89 0.29 0)

    (6.60 0.86 0)     // 5.8535 + 0.75
    (6.60 0.57 0)
    (6.60 0.29 0)

    (7.31 0.86 0)     // 6.5635 + 0.75
    (7.31 0.57 0)
    (7.31 0.29 0)

    (7.89 0.86 0)     // 7.1436 + 0.75
    (7.89 0.57 0)
    (7.89 0.29 0)

    (8.60 0.86 0)     // 7.8535 + 0.75
    (8.60 0.57 0)
    (8.60 0.29 0)

    (9.32 0.86 0)     // 8.5685 + 0.75
    (9.32 0.57 0)
    (9.32 0.29 0)

    (10.18 0.86 0)    // 9.4305 + 0.75
    (10.18 0.57 0)
    (10.18 0.29 0)

    (10.89 0.86 0)    // 10.1385 + 0.75
    (10.89 0.57 0)
    (10.89 0.29 0)

    (11.60 0.86 0)    // 10.8535 + 0.75
    (11.60 0.57 0)
    (11.60 0.29 0)

    (12.32 0.86 0)    // 11.5685 + 0.75
    (12.32 0.57 0)
    (12.32 0.29 0)

    (12.89 0.86 0)    // 12.1435 + 0.75
    (12.89 0.57 0)
    (12.89 0.29 0)

    (13.31 0.86 0)    // 12.5635 + 0.75
    (13.31 0.57 0)
    (13.31 0.29 0)

    (14.18 0.86 0)    // 13.4285 + 0.75
    (14.18 0.57 0)
    (14.18 0.29 0)

    (14.89 0.86 0)    // 14.1385 + 0.75
    (14.89 0.57 0)
    (14.89 0.29 0)

    (15.61 0.86 0)    // 14.8585 + 0.75
    (15.61 0.57 0)
    (15.61 0.29 0)

    (16.32 0.86 0)    // 15.5735 + 0.75
    (16.32 0.57 0)
    (16.32 0.29 0)

    (17.03 0.86 0)    // 16.2835 + 0.75
    (17.03 0.57 0)
    (17.03 0.29 0)
);

alpha  alpha.water;

#includeEtc "caseDicts/functions/probes/interfaceHeight.cfg"

// foamPostProcess.exe -func interfaceHeight -field g

// ************************************************************************* //
