Hk42/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/


points
(
    (0.85 0.85 0)   // Rue_Gauche
    (0.85 0.75 0)   // Rue_Centre
    (0.85 0.65 0)   // Rue_Droite
    (0.85 0.55 0)   // Maison_Gauche
    (0.85 0.45 0)   // Maison_Centre
);


fields  (p U);


#includeEtc "caseDicts/functions/probes/probes.cfg"

// ************************************************************************* //
