Hk42/system/probes2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/


points
(

    (11.60 0.86 0)    
    (11.60 0.57 0.02)
    (11.60 0.29 0.04)

    (12.32 0.86 0)    
    (12.32 0.57 0.02)
    (12.32 0.29 0.04)

    (12.89 0.86 0)    
    (12.89 0.57 0.02)
    (12.89 0.29 0.04)

);


fields
(
    p_rgh
    Ux
    Uy
    Uz
);


#includeEtc "caseDicts/functions/probes/probes.cfg"

// ************************************************************************* //
