Hk42/system/probes3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/


points
(

    (12 0.000000000 0.0242)
    (12 0.118881119 0.0242)
    (12 0.188811189 0.0242)
    (12 0.272727273 0.0242)
    (12 0.342657343 0.0242)
    (12 0.412587413 0.0242)
    (12 0.496503497 0.0242)
    (12 0.566433567 0.0242)
    (12 0.636363637 0.0242)
    (12 0.727272727 0.0242)
    (12 0.797202797 0.0242)
    (12 0.867132867 0.0242)
    (12 0.937062937 0.0242)
    (12 1.000000000 0.0242)

    (11.25 0.000000000 0.0242)
    (11.25 0.118881119 0.0242)
    (11.25 0.188811189 0.0242)
    (11.25 0.272727273 0.0242)
    (11.25 0.342657343 0.0242)
    (11.25 0.412587413 0.0242)
    (11.25 0.496503497 0.0242)
    (11.25 0.566433567 0.0242)
    (11.25 0.636363637 0.0242)
    (11.25 0.727272727 0.0242)
    (11.25 0.797202797 0.0242)
    (11.25 0.867132867 0.0242)
    (11.25 0.937062937 0.0242)
    (11.25 1.000000000 0.0242)
);


fields
(
    p_rgh
    Ux
    Uy
    Uz
);


#includeEtc "caseDicts/functions/probes/probes.cfg"

// ************************************************************************* //
