Hk42/system/probesx1200
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/


points
(
    (12.00 0 0.0242)
    (12.00 0.017 0.0242)
    (12.00 0.027 0.0242)
    (12.00 0.039 0.0242)
    (12.00 0.049 0.0242)
    (12.00 0.059 0.0242)
    (12.00 0.071 0.0242)
    (12.00 0.081 0.0242)
    (12.00 0.091 0.0242)
    (12.00 0.104 0.0242)
    (12.00 0.114 0.0242)
    (12.00 0.124 0.0242)
    (12.00 0.134 0.0242)
    (12.00 0.143 0.0242)
    (12.00 0.153 0.0242)
    (12.00 0.163 0.0242)
    (12.00 0.173 0.0242)
    (12.00 0.182 0.0242)
    (12.00 0.192 0.0242)
    (12.00 0.202 0.0242)
    (12.00 0.214 0.0242)
    (12.00 0.224 0.0242)
    (12.00 0.234 0.0242)
    (12.00 0.246 0.0242)
    (12.00 0.256 0.0242)
    (12.00 0.266 0.0242)
    (12.00 0.276 0.0242)
    (12.00 0.286 0.0242)
    (12.00 0.296 0.0242)
    (12.00 0.306 0.0242)
    (12.00 0.316 0.0242)
    (12.00 0.325 0.0242)
    (12.00 0.335 0.0242)
    (12.00 0.357 0.0242)
    (12.00 0.377 0.0242)
    (12.00 0.389 0.0242)
    (12.00 0.399 0.0242)
    (12.00 0.409 0.0242)
    (12.00 0.419 0.0242)
    (12.00 0.43 0.0242)
    (12.00 0.44 0.0242)
    (12.00 0.45 0.0242)
    (12.00 0.46 0.0242)
    (12.00 0.468 0.0242)
    (12.00 0.478 0.0242)
    (12.00 0.488 0.0242)
    (12.00 0.5 0.0242)
    (12.00 0.51 0.0242)
    (12.00 0.52 0.0242)
    (12.00 0.532 0.0242)
    (12.00 0.542 0.0242)
    (12.00 0.552 0.0242)
    (12.00 0.562 0.0242)
    (12.00 0.572 0.0242)
    (12.00 0.582 0.0242)
    (12.00 0.592 0.0242)
    (12.00 0.602 0.0242)
    (12.00 0.611 0.0242)
    (12.00 0.621 0.0242)
    (12.00 0.631 0.0242)
    (12.00 0.643 0.0242)
    (12.00 0.653 0.0242)
    (12.00 0.663 0.0242)
    (12.00 0.675 0.0242)
    (12.00 0.685 0.0242)
    (12.00 0.695 0.0242)
    (12.00 0.705 0.0242)
    (12.00 0.715 0.0242)
    (12.00 0.725 0.0242)
    (12.00 0.735 0.0242)
    (12.00 0.745 0.0242)
    (12.00 0.754 0.0242)
    (12.00 0.764 0.0242)
    (12.00 0.774 0.0242)
    (12.00 0.786 0.0242)
    (12.00 0.796 0.0242)
    (12.00 0.806 0.0242)
    (12.00 0.818 0.0242)
    (12.00 0.828 0.0242)
    (12.00 0.838 0.0242)
    (12.00 0.848 0.0242)
    (12.00 0.858 0.0242)
    (12.00 0.868 0.0242)
    (12.00 0.878 0.0242)
    (12.00 0.888 0.0242)
    (12.00 0.897 0.0242)
    (12.00 0.907 0.0242)
    (12.00 0.917 0.0242)
    (12.00 0.929 0.0242)
    (12.00 0.9295 0.0242)
);

fields
(
    p_rgh
    Ux
    Uy
    Uz
);


#includeEtc "caseDicts/functions/probes/probes.cfg"

// ************************************************************************* //
